package series.fun.java.chap02.homework;

public class Remind {
	/* 01. 변수
	 * System.out의 print( ), printf( ), println( )을 이용해서
	 * 자료형 int, long, String을 가진 변수를 출력해보기 
	 */
	/********************************************************/
	public static void main(String[] args) {

	}
	/********************************************************/
	/* 02. 연산자
	 * Scanner를 이용해서 두 변수를 입력받아서 덧셈, 나눗셈, 곱하기, 나누기를 구현해보기
	 */
	/********************************************************/
//	public static void main(String[] args) {
//
//	}
	/********************************************************/
	/* 03. 조건문
	 * 점수를 입력받아서 점수별로 학점을 출력하기
	 * 91점~ : A
	 * 81~90점 : B
	 * 71~80점 : C
	 * 61~70점 : D
	 * ~60점 : F
	 */
	/********************************************************/
//	public static void main(String[] args) {
//
//	}
	/********************************************************/
	/* 04. 반복문
	 * 반복문을 활용해서 구구단을 출력해보세요
	 */
	/********************************************************/
//	public static void main(String[] args) {
//
//	}
	/********************************************************/
	/* 05. 배열
	 * 배열 [5,1,6,10,9,2]를 오름차순으로 정렬해보세요
	 */
	/********************************************************/
//	public static void main(String[] args) {
//
//	}
	/********************************************************/
	/* 06. 함수
	 * 랜덤으로 num1과 num2 사이의 정수를 반환하는 returnRandomNumber( )를 구현하세요
	 */
	/********************************************************/
//	public static void main(String[] args) {
//
//	}
	/********************************************************/
}
