/**
 * 객체지향언어
 * 
 * 실제 세계와 유사한 가상 세계를 컴퓨터 속에 구현하고자 하는 노력
 * 그래서 객체지향이론의 기본 개념은 '실제 세계는 사물(객체)로 이루어져 있으며,
 * 발생하는 모든 사건들은 사물간의 상호작용'이다.
 * 
 * 상속, 캡슐화, 추상화 개념을 중심으로 점차 구체적으로 발전됨
 * 1960년대 중반에 Simula라는 최초의 객체지향언어가 탄생
 * 당시의 FORTRAN, COBOL과 같은 절차적 언어들이 주류에 밀렸음
 * 
 * 1980년대 C++을 비롯해 여러 객체지향언어가 발표되었지만 사용자층이 많지 않았음
 * 
 * 프로그램의 규모가 점점 커지고 사용자들의 요구가 빠르게 변화해가는 상황을 절차적 언어로는 한계라는 인식 확대
 * JAVA가 1995년에 발표되고 1990년대 말 인터넷 발전으로 크게 유행, 객체지향언어는 이제 주류로 이뤄짐
 * 
 *  주요특징
 *  	1. 코드의 재사용성이 높다.
 *  	2. 코드의 관리가 용이하다.
 *  	3. 코드의 중복을 제거하는 등 신뢰성이 높은 프로그래밍을 가능하게 한다.
 *  
 *  클래스 -- (인스턴스화) --> 인스턴스(객체)
 *  
 *  
 */
package series.fun.java;
